{
  "Metadata": {
    "title": "Mohammed Sobhi's Portfolio",
    "description": "A Computer Engineer passionate about crafting user-friendly and accessible web applications with exceptional functionality"
  },
  "AboutMe": {
    "AboutMe": {
      "title": "About Me",
      "name": "Mohammed Sobhi",
      "description": "A Computer Engineer passionate about crafting user-friendly and accessible web applications with exceptional functionality",
      "toggleLocale": "AR",
      "ariaLabelToggleLocale": "Switch to the Arabic version"
    },
    "Skills": {
      "title": "Skills"
    },
    "Contact": {
      "title": "Get in touch",
      "links": {
        "resume": "Resume",
        "github": "Github",
        "linkedin": "LinkedIn",
        "email": "Email"
      }
    }
  },
  "MyProjects": {
    "title": "My Projects",
    "demo": "Live Demo",
    "code": "Code",
    "original": "Original",
    "projects": {
      "breadit": {
        "title": "Breadit",
        "year": "2023",
        "description": "Breadit is a Reddit clone where users can create and join communities, leave comments, and upvote or downvote posts and comments. Built with Next.js 13 app router and uses interception and parallel routing features. It also utilizes Redis for caching, Next Auth, PlanetScale (MySQL) with Prisma ORM, and TailwindCSS.",
        "alt": "Breadit feed: Recent posts from your joined communities.",
        "isOriginal": "0"
      },
      "portfolio": {
        "title": "Portfolio",
        "year": "2023",
        "description": "A minimalist and responsive portfolio with accessibility in mind.",
        "alt": "You are currently here.'About Me' column on the left, 'My Projects' on the right.",
        "isOriginal": "1"
      },
      "king": {
        "title": "King's Revenge",
        "year": "2023",
        "description": "A platformer game with hit-box and collision detection built entirely in vanilla JavaScript.",
        "alt": "King in red armor, golden crown, light blue cape, standing in a swamp.",
        "isOriginal": "0"
      },
      "globe": {
        "title": "Globe",
        "year": "2023",
        "description": "An interactive globe created with Three.js and GASP.",
        "alt": "Earth in space, highlighting the MENA (Middle East and North Africa) region.",
        "isOriginal": "0"
      },
      "appleStore": {
        "title": "Apple-like Store",
        "year": "2022",
        "description": "A Next.js eCommerce project that took inspiration from Apple stores. The project takes advantage of Sanity CMS to manage product information, Stripe to provide seamless credit card payments, and TailwindCSS for styles.",
        "alt": "Apple-like store: iPhone 14 showcased with 'iPhone 14 big and bigger' text.",
        "isOriginal": "0"
      },
      "proShop": {
        "title": "proShop",
        "year": "2022",
        "description": "A React and Express.js eCommerce project with reviews and rating features and an admin page to handle all products, orders, and payments. Registration via email and JWT tokens for authentication Stores data with MongoDB and PayPal SDK for effortless payments.",
        "alt": "main page of ProShop featuring PS4 and the latest products.",
        "isOriginal": "0"
      },
      "memories": {
        "title": "Memories",
        "year": "2022",
        "description": "Share your precious memories with others and engage with the community through likes and comments. Every user has a profile, an auto-complete search bar, and amazing light and dark modes. 'Memories' is my first MERN original project, which utilized React.js for the front-end and Express.js for the back-end. To ensure security, account activation is done via email, and authentication is implemented through JWT access and refresh tokens.",
        "alt": "Eight posts with large images, user details, links, and comments.",
        "isOriginal": "1"
      },
      "grad": {
        "title": "Auto-Correction Smart Examination System",
        "year": "2021",
        "description": "Graduation project built with Oracle APEX. This system is based on the randomization of questions and variable answers generated by the system to prevent cheating.",
        "alt": "Light blue announcements box, followed by a user greeting message and colorful list of courses.",
        "isOriginal": "1"
      }
    }
  }
}
